app/controllers/complaints_controller.rb

SELECT "complaints".* FROM "complaints"
---
  def index
    @complaints = Complaint.all

INSERT INTO "complaints" ("title", "description", "status", "numVotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "complaint 1"], ["description", "describe 1"], ["status", "NOT_VERIFIED"], ["numVotes", 0], ["created_at", "2022-11-20 10:29:25.941417"], ["updated_at", "2022-11-20 10:29:25.941417"]]
---
  def create
    @complaint = Complaint.new(complaint_params)
    respond_to do |format|
      if @complaint.save

UPDATE "complaints" SET "title" = ?, "updated_at" = ? WHERE "complaints"."id" = ?  [["title", "complaint 2"], ["updated_at", "2022-11-20 14:40:27.807039"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @complaint.update(complaint_params)

DELETE FROM "complaints" WHERE "complaints"."id" = ?  [["id", 1]]
---
  def destroy
    @complaint.destroy

SELECT "complaints".* FROM "complaints" WHERE "complaints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_complaint
      @complaint = Complaint.find(params[:id])